app/controllers/jobs_controller.rb

  def new
    @job = Job.new
    @positions = Position.all
---
SELECT "positions".* FROM "positions"