app/controllers/notes_controller.rb

INSERT INTO "notes" ("content", "job_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["content", "This is a new note"], ["job_id", 1], ["created_at", 2017-03-05 21:32:14 UTC], ["updated_at", 2017-03-05 21:32:14 UTC]]
---
	def create
		p "In Create Action"
		@note = Note.new(note_params)
		@job = Job.find(@note.job_id)

		respond_to do |format|
			if @note.save

UPDATE "notes" SET "content" = ?, "updated_at" = ? WHERE "notes"."id" = ?
---
	def update
		respond_to do |format|
			if @note.update(note_params)